ProyectoBibliotech/app/controllers/categorias_controller.rb

    def index

      @categorias = Categoria.all

      # /categorias?id_tipo_prod=
      @categorias = @categorias.where(id_tipo_prod:1) if params[:id_tipo_prod] == '1'
      @categorias = @categorias.where(id_tipo_prod:2) if params[:id_tipo_prod] == '2'
      @categorias = @categorias.where(id_tipo_prod:3) if params[:id_tipo_prod] == '3'
---
SELECT "CATEGORIAS".* FROM "CATEGORIAS"
SELECT "CATEGORIAS".* FROM "CATEGORIAS" WHERE "CATEGORIAS"."ID_TIPO_PROD" = :a1  [["id_tipo_prod", 1]]