ProyectoBibliotech/app/controllers/detalleprestamos_controller.rb

SELECT "DETALLEPRESTAMOS".* FROM "DETALLEPRESTAMOS"
SELECT "DETALLEPRESTAMOS".* FROM "DETALLEPRESTAMOS" WHERE "DETALLEPRESTAMOS"."LUGAR" = :a1  [["lugar", "Domicilio"]]
SELECT "PRODUCTOS".* FROM "PRODUCTOS" WHERE "PRODUCTOS"."ID_PRODUCTO" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id_producto", 200103], ["LIMIT", 1]]
SELECT "DETALLEPRESTAMOS".* FROM "DETALLEPRESTAMOS" WHERE "DETALLEPRESTAMOS"."LUGAR" = :a1 AND "DETALLEPRESTAMOS"."ID_PRODUCTO" = :a2  [["lugar", "Sala"], ["id_producto", nil]]
---
  def index

    @detalleprestamos = Detalleprestamo.all


    # /detalleprestamos?lugar=        id_prestamo
    @detalleprestamos = @detalleprestamos.where(lugar: 'Sala') if params[:lugar] == 'Sala'
    @detalleprestamos = @detalleprestamos.where(lugar: 'Domicilio') if params[:lugar] == 'Domicilio'
    @detalleprestamos = @detalleprestamos.where(lugar: 'Sala y Domicilio') if params[:lugar] == 'Sala y Domicilio'
    @detalleprestamos = @detalleprestamos.where(id_producto: params[:id_producto]) if params[:id_producto]