ProyectoBibliotech/app/controllers/prestamos_controller.rb

SELECT "DETALLEPRESTAMOS".* FROM "DETALLEPRESTAMOS"
SELECT "PRESTAMOS".* FROM "PRESTAMOS" WHERE "PRESTAMOS"."ID_PRESTAMO" = :a1 FETCH FIRST :a2 ROWS ONLY  [["id_prestamo", 50], ["LIMIT", 1]]
SELECT "DETALLEPRESTAMOS".* FROM "DETALLEPRESTAMOS" WHERE "DETALLEPRESTAMOS"."LUGAR" = :a1  [["lugar", "Sala"]]
---
  def index

    @prestamos = Prestamo.all
    @detalleprestamos = Detalleprestamo.all

    @detalleprestamos = @detalleprestamos.where(id_prestamo: params[:id_prestamo]) if params[:id_prestamo]

    # /detalleprestamos?lugar=
    @detalleprestamos = @detalleprestamos.where(lugar: 'Sala') if params[:lugar] == 'Sala'
    @detalleprestamos = @detalleprestamos.where(lugar: 'Domicilio') if params[:lugar] == 'Domicilio'
    @detalleprestamos = @detalleprestamos.where(lugar: 'Sala y Domicilio') if params[:lugar] == 'Sala y Domicilio'