ProyectoBibliotech/app/controllers/productos_controller.rb

SELECT "PRODUCTOS".* FROM "PRODUCTOS"
SELECT "PRODUCTOS".* FROM "PRODUCTOS" WHERE "PRODUCTOS"."LUGAR_PREST" = :a1  [["lugar_prest", "Sala y Domicilio"]]
SELECT "PRODUCTOS".* FROM "PRODUCTOS" WHERE "PRODUCTOS"."LUGAR_PREST" = :a1  [["lugar_prest", "Sala"]]
SELECT "PRODUCTOS".* FROM "PRODUCTOS" WHERE "PRODUCTOS"."LUGAR_PREST" = :a1  [["lugar_prest", "Domicilio_Sala"]]
SELECT "PRODUCTOS".* FROM "PRODUCTOS" WHERE "PRODUCTOS"."ID_CATEGORIA" = :a1  [["id_categoria", 10]]
SELECT "PRODUCTOS".* FROM "PRODUCTOS" WHERE "PRODUCTOS"."ID_CATEGORIA" = :a1  [["id_categoria", 11]]
SELECT "PRODUCTOS".* FROM "PRODUCTOS" WHERE "PRODUCTOS"."LUGAR_PREST" = :a1 AND (titulo like '%%') AND (autor like '%%') AND "PRODUCTOS"."ID_CATEGORIA" = :a2  [["lugar_prest", "Sala"], ["id_categoria", 10]]
---
    def index
      # render json: Producto.all

      @productos = Producto.all

      # /productos?lugar_prest=
      @productos = @productos.where(lugar_prest: 'Sala') if params[:lugar_prest] == 'Sala'
      @productos = @productos.where(lugar_prest: 'Sala y Domicilio') if params[:lugar_prest] == 'Sala y Domicilio'
      # @productos = Producto.all if params[:lugar_prest] == ''

      # /productos?titulo=
      #@productos = @productos.where(titulo:params[:titulo]) if params[:titulo]
      @productos = @productos.where("titulo like :q", :q => "%#{params[:titulo]}%") if params[:titulo]
      @productos = @productos.where("autor like :q", :q => "%#{params[:autor]}%") if params[:autor]

      # /productos?id_categoria=
      @productos = @productos.where(id_categoria:10) if params[:id_categoria] == '10'
      @productos = @productos.where(id_categoria:11) if params[:id_categoria] == '11'
      @productos = @productos.where(id_categoria:12) if params[:id_categoria] == '12'
      @productos = @productos.where(id_categoria:13) if params[:id_categoria] == '13'
      @productos = @productos.where(id_categoria:20) if params[:id_categoria] == '20'
      @productos = @productos.where(id_categoria:21) if params[:id_categoria] == '21'
      @productos = @productos.where(id_categoria:30) if params[:id_categoria] == '30'
      @productos = @productos.where(id_categoria:31) if params[:id_categoria] == '31'

SELECT "PRODUCTOS".* FROM "PRODUCTOS" WHERE (titulo like '%El%') AND (autor like '%Roman%')
---
    def show
      render json: Producto.find(params[:id])