ProyectoBibliotech/app/controllers/reservas_controller.rb

SELECT "RESERVAS".* FROM "RESERVAS"
---
    def index
      render json: Reserva.all

INSERT INTO "RESERVAS" ("RUT_LECTOR", "FECHA_RESERVA", "ID_PRODUCTO", "ID_RESERVA") VALUES (:a1, :a2, :a3, :a4)  [["rut_lector", "12798044-0"], ["fecha_reserva", "2021-05-15"], ["id_producto", 200103], ["id_reserva", 5]]
---
    def create
      @reserva = Reserva.new(reserva_params)

      if @reserva.save