ProyectoBibliotech/app/controllers/tipoproductos_controller.rb

    def index
      render json: Tipoproducto.all
---
SELECT "PRODUCTOS".* FROM "PRODUCTOS"
SELECT "TIPOPRODUCTOS".* FROM "TIPOPRODUCTOS"